# BackgroundColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..BackgroundColor Property
Application Class See Also
---
The background color to use for model views in this session.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Color BackgroundColor { get; set; }
```

Visual Basic
---
```text
Public Property BackgroundColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ BackgroundColor {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The backgroundColor argument does not represent a valid color. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace